OpenFOAM8/tutorial/cubeErlend/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

Lx  1.0;
Ly  1.0;
Lz  0.05;

// diagOut #calc "$rOut*sqrt(2.)/2.";
// diagIn #calc "$rIn*sqrt(2.)/2.";

vertices
(
    (0   0   0)
    ($Lx 0   0)
    ($Lx $Ly 0)
    (0   $Ly 0)
    (0   0   $Lz)
    ($Lx 0   $Lz)
    ($Lx $Ly $Lz)
    (0   $Ly $Lz)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (40 40 1) simpleGrading (1 1 1)
);

edges
(
    // arc 1 2 ($diagOut $diagOut 0)
    // arc 3 0 ($diagIn $diagIn 0)
    // arc 5 6 ($diagOut $diagOut 1)
    // arc 7 4 ($diagIn $diagIn 1)
);

boundary
(
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 5 4)
            (2 3 7 6)
        );
    }

    // front
    // {
    //     type patch;
    //     faces
    //     (
    //         (0 1 5 4)
    //     );
    // }

    // back
    // {
    //     type patch;
    //     faces
    //     (
    //         (2 3 7 6)
    //     );
    // }

    top
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }

    bottom
    {
        type patch;
        faces
        (
            (3 2 1 0)
        );
    }

    left
    {
        type patch;
        faces
        (
            (4 3 7 0)
        );
    }

    right
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
