OpenFOAM8/tutorial/cubeErlend/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    // inlet
    // {
    //     type            fixedValue;
    //     value           uniform 1.1e5;
    //     name    rampedFixedValue;   // name of generated BC

    //     code
    //     #{
    //         operator==(min(1.1e5, 1e5 + 1*this->db().time().value()));
    //     #};

    //     // codeInclude
    //     //#{
    //     //    #include "fvCFD.H"
    //     //#};

    //     // codeOptions
    //     //#{
    //     //    -I$(LIB_SRC)/finiteVolume/lnInclude
    //     //#};
    // }

    "top"
    {
        type            fixedValue;
        value           uniform 0.000;        
    }

    "left|right|bottom"
    {
        type            fixedValue;
        value           uniform 0.0;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
