OpenFOAM8/tutorial/cubeErlend/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default steadyState;

}

d2dt2Schemes
{
	default steadyState;
}

gradSchemes
{
    default         leastSquares;
	grad(D)         pointCellsLeastSquares;

}

divSchemes
{
    default         Gauss linear;
}

laplacianSchemes
{
    default            		none;
	laplacian(mu,D) 		Gauss linear corrected;
	laplacian(Mf,p)			Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
    interpolate(U)  linear;
}

snGradSchemes
{
    default         orthogonal;
}

fluxRequired
{
    default none;
    p yes;
}


// ************************************************************************* //
