OpenFOAM8/tutorial/cubeErlend/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volTensorFieldValue K (1e-15 0 0 0 1e-15 0 0 0 1e-15)
);

regions
(
    // boxToCell
    // {
    //     box (0 0 0) (0.45 0.45 1);
	//
    //     fieldValues
    //     (
    //         volTensorFieldValue K (1e-18 0 0 0 1e-18 0 0 0 1e-18)
    //     );
    // }
	//
    // boxToCell
    // {
    //     box (0 0.55 0) (0.45 1 1);
	//
    //     fieldValues
    //     (
    //         volTensorFieldValue K (1e-18 0 0 0 1e-18 0 0 0 1e-18)
    //     );
    // }
	//
    // boxToCell
    // {
    //     box (0.55 0 0) (1 0.45 1);
	//
    //     fieldValues
    //     (
    //         volTensorFieldValue K (1e-18 0 0 0 1e-18 0 0 0 1e-18)
    //     );
    // }
	//
    // boxToCell
    // {
    //     box (0.55 0.55 0) (1 1 1);
	//
    //     fieldValues
    //     (
    //         volTensorFieldValue K (1e-18 0 0 0 1e-18 0 0 0 1e-18)
    //     );
    // }

);


// ************************************************************************* //
